Revit 2024 API
Space.Occupiable Property
Reports whether this zone is Occupiable or not.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool Occupiable { get; }
Visual Basic
Public ReadOnly Property Occupiable As Boolean
	Get
Visual C++
public:
property bool Occupiable {
	bool get ();
}
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace